In [1]:
import pandas as pd

In [2]:
data = {
    'name': ['John', 'Anna', 'Peter', 'Linda'],
    'age': [28,27,32,14],
    'city': ['New York', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)
print(df)

    name  age      city
0   John   28  New York
1   Anna   27     Paris
2  Peter   32    Berlin
3  Linda   14    London

In [3]:
df['Salario'] = [50000, 60000, 70000, 80000]
print(df)

    name  age      city  Salario
0   John   28  New York    50000
1   Anna   27     Paris    60000
2  Peter   32    Berlin    70000
3  Linda   14    London    80000

In [4]:
df['Salario'] = df['Salario'] + 2000
print(df)

    name  age      city  Salario
0   John   28  New York    52000
1   Anna   27     Paris    62000
2  Peter   32    Berlin    72000
3  Linda   14    London    82000

In [5]:
name = df['name']
name

0     John
1     Anna
2    Peter
3    Linda
Name: name, dtype: object

In [6]:
mayores25 = df[df['age'] > 25]
print(mayores25)

    name  age      city  Salario
0   John   28  New York    52000
1   Anna   27     Paris    62000
2  Peter   32    Berlin    72000

In [7]:
libros_df = {
    'Titulo':[ "El Quijote", "Cien a単os de soledad", "La odisea"],
    'Autor': ['Miguel de Cervantes', 'Gabriel Garcia Marquez', 'Homero'],
    'A単o': [1605, 1967, -800]
}
df_libros = pd.DataFrame(libros_df)
print(df_libros)

                 Titulo                   Autor   A単o
0            El Quijote     Miguel de Cervantes  1605
1  Cien a単os de soledad  Gabriel Garcia Marquez  1967
2             La odisea                  Homero  -800